# 2
# custom ფუნქცია არის  ადამიანის მიერ შექმნილი საკუთარი ფუნქცია, ის გამოიყენება კოდის გამარტივებისთვის ანუ თუ ერთი და იგივე კოდის გამეორება
# თუ დაგვჭირდება
# მისი შექმნის წესი ესეთია 
# №1 ჯერ ვწერთ def-ს რათა პროგრამას გავაგებინოთ რომ ვქმნით დუნქციას
# №2 def-ის შემდეგ ჩვენ ვარქმევთ ფუნქციის შემდეგ
# №3 def-ის და ფუნქციის სახელის შემდეგ ბრჩხილებში საჭიროების შემთხვევაშ გადავცემთ პარამეტრს
# №4 ამ ყველაფრის შემდეგ ჩვენ  ვუწერთ რას გააკეთებს და ასევე return-ს თუ გვინდა რამე რომ დაგვიბრუნოს
# მარტივი მაგალითს გავაკეთებ 

def mult(a, b):
    return a * b
print(mult(5,10))


# 3
def add(a,b):
    return a + b



# 4
def check(num):
    if num % 2 == 0:
        print('რიცხვი ლუწია')
    else:
        print('რიცხვი კენტია')    


# 5
def double(num):
    return num ** 2



 # 6
def text(a):
    return a.upper()


 # 7
def fullname(name,surname):
    return name +' '+ surname

print(fullname('nika','bezhashvili'))



