# 2
# ამ დროს არ ვიყავი ამ ჯგუფში და არ ვიცი კონკრეტულად რა გაიარეს ამ გაკვეთილზე

# 3
# Debugging ნიშნავს შეცდომის გამოსწორებას და აქვს 3 ეტაპი|1 ეტაპი) შეცდომის აღმოჩენა |
# 2 ეტაპი) ამ შეცდომის აღმოფხვრის ხერხის აღმოჩენა | 3 ეტაპი) ამ შეცდომის გამოსწორება

# 4.1
# შეცდომა
# print("Hello World'

# გამოსწორება
# print("Hello World")

# _____________________________________________________________________________________________________________

# 4.2
# შეცდომა
# x = y + 5   # y არ არის განსაზღვრული

# გამოსწორება
# y = 10
# x = y + 5

# _____________________________________________________________________________________________________________

# 4.3
# შეცდომა
# age = "25"
# print(age + 5)   # string + int

# გამოსწორება
# age = int("25")
# print(age + 5)

# _____________________________________________________________________________________________________________

# 4.4
# შეცდომა
# print(Hello World)

# გამოსწორება
# print("Hello World")

# _____________________________________________________________________________________________________________

# 4.5

# შეცდომა
# age = 25
# print(age + '5')   # string + int

# გამოსწორება
# age = 25
# print(age + 5)




# 5  ამ დროს არ ვიყავი ამ ჯგუფში და არ ვიცი კონკრეტულად რა გაიარეს ამ გაკვეთილზე

# 6 ნაყურები მაქვს

# 7
name = "Nika"
age = 20
city = "Tbilisi"

sentence = f"My name is {name}, I am {age} years old and I live in {city}."

print(sentence)
