# 1) terminal-ში print() ფუნქციის გამოყენებით დაბეჭდოთ თითო სახის მონაცემთა ტიპი.

# 2) შექმენით 4 ცვლადი. პირველ ცვლადში შეინახეთ თქვენი სახელი,  მეორე ცვლადში შეინახეთ თქვენი ასაკი, მესამე ცვლადში შეინახეთ თქვენი საყვარელი საკვები და მეოთხე ცვლადში შეინახეთ თქვენი საყვარელი ფერი. (არ დაგავიწყდეთ print() ფუნქციის დახმარებით თითოეული ცვლადის მნიშნელობის დაბეჭდვა.
# 1
# str
print("ნიკა")
# int
print(14)
# float
print(14.5)

# 2
name = "ნიკა"
age = 14
food = "ხინკალი"
color = "შავი"

print(name)
print(age)
print(food)
print(color)