# 1
# Flowchart — არის დიაგრამა სადაც პროცესის ყველა ნაბიჯი რიგრიგობით არის ნაჩვენები სიმბოლოებით ან  ისრებით
# 2
# sequencing როდესაც პროგრამა ბრაძანებას ასრულებს რიგობრივად ანუ ჯერ 1 მერე 2 მერე 3 და ა.შ
# selection როდესაც პროგრამა აკეთებს იმა თუ ამ დავალებაში  არჩევანს
# iteration იტერაცია ანუ როდესაც პროგრამა ერთი და იმავე ნაბიჯ/კოდის ნაწილს ამეორებს
# მოკლედ რომ ვთქვათ ყველას აქვს თავისი დანიშნულება 
# Sequencing = უბრალოდ რიგობრივად კოდის სესრულება 
# Selection = არჩევა
# Iteration = განმეორება

# 3
# თუ გვეუბნებიან რომ F = (C * 9/5) + 32 მაშინ უბრალოდ მათემატიკური ხერხს გამოვიყენებდ და გამოვა ასე
# C * 9/5 = F-32 გადმოვიტანთ 9/5 მეორე მხარეს და გამოვა ასე c = (f-32) / 9/5| 9/5-ს ამოვატრიალებთ და გამოგვივა ასეთი შედეგი 
# c = (f-32) * 5/9

F = float(input("ფარენჰეიტი: "))
C = (F - 32) * 5/9

print("ცელსიუსი:", C)
