
# 2
# ფუნქცია არის კოდი რომელიც ასრულებს კონკრეტულ დავალებას და რომელსაც შეუძლია მიიღოს მონაცემები (არგუმენტები) 
# და დააბრუნოს შედეგი.

# 3
# print() არის  ფუნქცია რომელიც გამოიყენება ტექსტის ან სხვა მონაცემების კონსოლში დაბეჭდვისთვის.

# 4
# არგუმენტები არის მონაცემები რომლებიც გადაეცემა ფუნქციას მისი გამოძახებისას, რათა ფუნქციამ იმუშაოს ამ მონაცემებთან.

# 5
name = "ნიკა"
age = 15
favorite_color = "შავი"
hobby = "პროგრამირება"
print(f"გამარჯობა, ჩემი სახელია {name}, მე ვარ {age} წლის, ჩემი საყვარელი ფერია {favorite_color} და ჩემი ჰობია {hobby}. ")

