// Task 2
/* 
სულ არსებობს 8 მონაცემთა ტიპი js-ში
1) Number - მონაცემთა ტიპი რომელშიც შედის ყველა რიცხვი გინდ მთელი გინდ ათწილადი

2) BigInt - მონაცემთა ტიპი რომელშიც შედის ძალიან დიდი რიცხვები მაგ 198326672379142...

3) string - მონაცემთა ტიპი რომელშიც შედის ნებისმიერი სიმბოლო ან სიმბოლოთა კრებული რომელიც მოქცეული ბრჭყალებში ' ' ან " "

4) Boolean - მონაცემთა ტიპი რომელშიც შედის მხოლოდ ორი მნიშვნელობა: True და False 

5) Null - მონაცემთა ტიპი რომელსაც  აქვს 1 მნიშვნელობა  მაგრამ ნიშნავს არაფერს

6) Undefined - მონაცემთა ტიპი რომელიც ნიშნავს რომ მნიშვნელობას არ აქვს მინიჭებული

7) Symbol -  როგორც გავიგე გამოიყენება იმისთვის რომ Id მივანიჭოთ რაღაცას

8)object - მონაცემთა ტიპია რომელშიც შედის ნებისმიერი მონაცემთა ტიპი ესე რომ ვთქვათ თითქმის ერთი და იგივეა რაც პიტონში სია

*/


// task 3

// primitive data types არის ყველაზე მარტივი ტიპები რომელშიც შედის ყველა მონაცემი გარდა object

// 4

// 4.1
let a = "Nika " + "Bezhashvili";
console.log(a);

// 4.2
let b = "Age: " + 20;
console.log(b);

// 4.3
let c = "Is student? " + true;
console.log(c);

// 4.4
let city = "Tbilisi";
let message = "I live in " + city;
console.log(message);

// 4.5
let intro = "My name is " + "Nika" + ", I am " + 15 + " years old.";
console.log(intro);
