# 2
name = input("შეიყვანე შენი სახელი: ")
print("გამარჯობა,", name)


# 3
num = int(input("შეიყვანე რიცხვი: "))
print("შენი რიცხვის ორჯერ მეტი არის:", num * 2)


# 4
# დამატება
a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))
print("ჯამი =", a + b)

# გამოკლება
x = int(input("შეიყვანე პირველი რიცხვი: "))
y = int(input("შეიყვანე მეორე რიცხვი: "))
print("სხვაობა =", x - y)

# გამრავლება
m = int(input("შეიყვანე პირველი რიცხვი: "))
n = int(input("შეიყვანე მეორე რიცხვი: "))
print("ნამრავლი =", m * n)

# გაყოფა
p = int(input("შეიყვანე პირველი რიცხვი: "))
q = int(input("შეიყვანე მეორე რიცხვი: "))
print("გაყოფის შედეგი =", p / q)

# ნაშთიანი გაყოფა
r = int(input("შეიყვანე პირველი რიცხვი: "))
s = int(input("შეიყვანე მეორე რიცხვი: "))
print("ნაშთი =", r % s)


# 5
person1 = input("პირველი ადამიანი: ")
person2 = input("მეორე ადამიანი: ")

q1 = input(person1 + ": გამარჯობა, როგორ ხარ? ")
q2 = input(person2 + ": კარგად ვარ, შენ? ")
q3 = input(person1 + ": მეც კარგად ვარ. რას აკეთებ? ")
q4 = input(person2 + ": ვსწავლობ Python-ს. შენ? ")
q5 = input(person1 + ": მეც Python-ს ვსწავლობ. კარგია!")


# 6
# input-ი არის შემავალი ინფორმაცია და ჩვენ მას ვიყენებთ რომ მომხმარებლისგან მივიღოთ ინფორმაცია 


# 7
# int() არის ერთ ერთი type convertion-ის წევრი 
# გამოიყენება იმისთვის რომ მაგ. სტრინგი მონაცემთა ტიპის რიცხვი გახდეს ინტეჯერად


# 8
# str() არის ერთ ერთი type convertion-ის წევრი 
# გამოიყენება იმისთვის რომ მაგ. ინტეჯერი მონაცემთა ტიპი გახდეს სტრინგად

# 9,10 - done