# 2
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))

num4 = (num1 + num2 + num3) / 3

print("საშუალო არითმეტიკული:", num4)

# 3
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
# ისე თუ რამე float ს იმიტომ ვწერ რომ input ით მონაცემი ხდება str  და მათემატიკური ოპერაცია რომ მოვახდინოთ გვჭირდება 
# float ან int  მარა int როომ დამეწერა მომხმარებელმა შეიძლება წილადი რიცხვი შემოიტანოს და მაგიტომ float 
# ესე ვთქვათ ერთი ტყვიით ორ კურდღელს ვკლავთ

print(num1 + num2)

# 4

# data type/მონაცემთა ტიპი

# string(str) ანუ სტრინგი| მონაცემთა ტიპი რომელშიც შედის ნებისმიერი რამ რაც არის მოქცეული ბრჭყალებში "" მაგალითად "ნიკა"

# integer(int) ინტეჯერი|მონაცემთა ტიპი რომელშიც შედის მხოლოდ მთელი რიცხვები ანუ 1/2/3/4/.../500/1000/1500/...

# float ფლოათი| მონაცემტა ტიპი რომელშიც შედის მხოლოდ წილად რიცხვები ანუ 0,005/0,05/0,5/.../300,5/...

# Python თითოეულ Data Type-ს განსხვავებულად ეპყრობა 

# string (str) — ტექსტად აღიქვამს და მასზე აკეთებს ტექსტურ ოპერაციებს 

# integer (int) — მთელ რიცხვად აღიქვამს და იყენებს მათემატიკურ გამოთვლებში

# float — ათწილად რიცხვად აღიქვამს და იყენებს წერტილოვანი გამოთვლებისთვის