# 1 
age = int(input("შემოიტანეთ თქვენი ასაკი: "))
print(age)

# 2
# input -ი არის შემავალი ინფორმაცია ხოლო output - ი არის გამავალი ინფორმაცია 
# მათი განსხვავება არის ის რომ რომცა input - ს ვიყენებთ ჩვენ ვაძლევთ ინფორმაციას კომპიუტერს
# ხოლო output ით კომპიუტერი გვიბრუნებს შედეგს

#3
num1 = int(input("ჩაწერეთ თქვენი პირველი რიცხვი: ")) 
num2 = int(input("ჩაწერეთ თქვენი მეორე რიცხვი: ")) 

# 1
# მიმატება +
print(num1+num2)

# გამოკლება -

print(num1 - num2)
# გამრავლება *

print(num1 * num2)

# გაყოფა /

print(num1/num2)

# 4
color = input("შეიყვანე შენი საყვარელი ფერი: ")
animal = input("შეიყვანე შენი საყვარელი ცხოველი: ")
place = input("შეიყვანე შენი საყვარელი დასასვენებელი ადგილი ან ქვეყანა: ")

print("Your favorites are: Color: " + color + ", Animal: " + animal + ", Place: " + place)

# 5
car1 = input("შეიყვანე პირველი მანქანის სახელი და მოდელი: ")
car2 = input("შეიყვანე მეორე მანქანის სახელი და მოდელი: ")
car3 = input("შეიყვანე მესამე მანქანის სახელი და მოდელი: ")
car4 = input("შეიყვანე მეოთხე მანქანის სახელი და მოდელი: ")


print("1) " + car2) 
print("2) " + car1)
print("3) " + car4)
print("4) " + car3)