# 1
# კომენტარი — ეს არის ტექსტი, რომელსაც პროგრამა არ კითხულობს 
# ის გამოიყენება კოდის ასახსნელად ან შესახსენებლად, რომ უკეთ გავიგოთ, რას აკეთებს პროგრამა 
# Python-ში კომენტარი იქმნება სიმბოლოთი "#"

# 2
# მოკლედ რომ ვთქვათ case-sensitive ნიშნავს რომ დიდი და პატარა ასოები განსხვავებულად აღიქმება 
# მაგალითად ცვლადები 'name' და 'Name' განსხვავებულად ითვლება

# 3
# მოკლედ რომ ვთქვათ snake_case ნიშნავს სიტყვების გაყოფას ქვედა ტირით _

# 4
# bug — ნიშნავს შეცდომას პროგრამაში.
# debugging — ნიშნავს ამ შეცდომების პოვნასა და გამოსწორებას.

print("Hello World")  # აქ " აკლდა
city = "London"      # აქ = მაგივრად -> ეწერია
print ("City")          # აქ print - ის მაგივრად pritn ეწერა და ორი " აკლდა