# 2
# სია ანუ list არის მონაცემთა ტიპი python-ში
# რომელიც გამოიყენება იმისთვვის რომ რამდენიმე მნიშვნელობა ერთ ცვლადში შევინახოთ 
# მაგ. გვინდა რამდენიმე სახელის შენახვა 
# ლ~სია რომ არ გამოვიყენოთ ასე უნდა გავაკეთოთ
name1 = 'ნიკა'
name2 = 'გიო'
name3 = 'დავითი'
name4 = 'ვანო'  #ან რამე სხვა სახელები 
#  ამდენი ცვლადების შექმნის მაგივრად ჩვენ შეგვიძლია გამოვიყენოთ list-ები რაც საქმეს გაგვიმარტივებს
name =['ნიკა','გიო','დავითი','ვანო']
# მისი შექმნა ადვილია იგივე ცვლადია მაგრამ უბრალო ბრჩხილების () მაგვივრად ვწერთ კვადრატულ ბრჩხილებს  []

# 3
# ესე რომ ვთქვათ ინდექსი არის სიაში ჩაწერილ ელემენტების ნომერი ან ადგილი ვთქვათ გვაქვს სია
#arr = [1 , 2 , 3 , 4 , 5]     აქ 3 ის ინდექსი არის 2 რადგან პითოში ათვლა იწყება ნულიდან და რიგითი ნომერია აქვთ ასეთი
#       0   1   2   3   4

# 4
arr = ['tazo', 'gio', 'luka', 'saba','akaki' ,'mate', 'mari']
arr [0] = 'nika'
arr[4] ='barbare'
print(arr)

# 5
arr = [11,'hello',3.14, True,'python','html']
print(arr[1])
print(arr[3])
print(arr[5])

# ელემენტები გამოგვაქვს ინდექსის მეშვეობით

#  6) ლისტს და ცვლადს შორის განსხვავება ახსენით ასევე კომენტარებით.
# 6
# როგორც გავიგე ძაან დიდი განშხვავებაც არა აქვთ   სიას და ცვლად
# ცვლადი ინახავს ერთ მნიშვნელობას ხოლო სიას შეუძლია ჰქონდეს უამრავი მნიშვნელობა
# ცვლადს არ აქვს ინდექსი ხოლო სიას აქვს 
#  სიის შექმნისთვის ჩვენ გვჭირდება კვადრატული ბრჩხილები[] ხოლო ცვლადის შექმნისთვისთვის უბრალო ()