# 2
# append ის მეშვეობით ჩვენ შეგვიძლია სიაში დავამატოთ ახალი ელემენტი რომელიც  დაემატება სიას ბოლოში

# insert თითქმის იგივე append მაგრამ insert-ის მეშვეობით ჩვენ შეგვიძლია ავირჩიოთ სად დაემატება

# pop ფუნქცია მარტივად რომ ვთქვათ შლის სიაში მყოფ ელემენტებს ასევე რომ გამოვიყენოთ ის ჩვენ არგუმენტად უნდა მივუთითოთ ელემენტის რიგითი ნომერი ანუ ინდექსი


# 3
a = [10, 20, 30, 40, 50]
print(len(a))

# 4
list = []
for i in range(5):
    num = int(input("Enter a number: "))
    list.append(num)

print(list)

# 5
colors = ["red", "green", "blue", "yellow", "purple"]
# რადგანაც pop ფუნქცია არგუმენტად იღებს ინდექსს და თუ არ მივუთითეთ ის წაშლის ბოლო ელემენტს მაგიტომაც არ ჩავუწერ  არგუმენტს რადგან საჭირო არ არის 
colors.pop()
print(colors)

# 6
animals = ["dog", "cat", "elephant", "lion"]
animals.insert(1, "monkey")
print(animals)

# 7
list = []
for i in range(3):
    sname = input('enter students name: ')
    list.append(sname)
list.insert(0, "Teacher")
list.pop()
print(len(list))
print(list)

# 8
# წავიკითხე და გავიგე რას აკეთებს sort(), clear(),copy(),extend(),
# sort() ფუნქცია ალაგებს სიას და ისედაც სიტყვა sort რომ გადავთარგმნოთ ქართულად ნიშნავს დალაგებას 

# clear() ფუნქცია შლის სიაში მყოფ ყველა ელემენტს და სიის ზომას ხდის 0-ს

# copy() ფუნქცია ქმნის სიის ზუსტ ასლს და აბრუნებს ახალ სიას რომელიც შეიცავს იმავე ელემენტებს რაც თავდაპირველ სიაშია

# extend() ფუნქცია საშუალებას გვაძლევს ერთ სიას დავამატოთ სხვა სიის ელემენტები