# 1) კომენტარების სახით ახსენით რას აკეთებს f სტრინგი და რა დანიშნულება გააჩნია, ხოლო შემდეგ გააკეთეთ ერთი პრაქტიკული მაგალითი თქვენი თავის შესახებ და ააწყეთ ერთი დიდი წინადადება, როგორც გაკვეთილზე გავაკეთეთ

# 1
# f სტრინგი არის ფორმატირებული სტრინგი, რომელიც საშუალებას გვაძლევს ჩავსვათ ცვლადების მნიშვნელობები პირდაპირ სტრინგში.
# მისი დანიშნულებაა გაამარტივოს სტრინგების ფორმატირება და გააუმჯობესოს კოდის წაკითხვა.


name = "ნიკა"
surname = "ბეჟაშვილი"
age = '15'
hobby = "programming"
role = "მინი ლიდერი"
fav_color = "შავი"
fav_car = "no info"
fav_academy = 'GOA'
print(f"მე მქვია {name} {surname}, მე ვარ {age} წლის. ჩემი ჰობია {hobby}. მე ვსწავლობ {fav_academy} ში როგორც {role}. ჩემი საყვარელი ფერია {fav_color}, ხოლო საყვარელი მანქანა - {fav_car}.")


name = 'no info'
surname = 'no info'
age = 'no info'
hobby = 'no info'
role = 'no info'
fav_color = 'no info'
fav_car = "no info"
fav_academy = 'no info'
print(f"მე მქვია {name} {surname}, მე ვარ {age} წლის. ჩემი ჰობია {hobby}. მე ვსწავლობ {fav_academy} ში როგორც {role}. ჩემი საყვარელი ფერია {fav_color}, ხოლო საყვარელი მანქანა - {fav_car}.")